# vstNameUndoEvent

## Description
```pascal
PROCEDURE vstNameUndoEvent(inUndoEventName : STRING);
```

```python

def vs.vstNameUndoEvent(inUndoEventName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inUndoEventName|STRING||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events